apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_spi_slave.c
      memcpy(&w_wd, priv->tx_buffer + i, sizeof(uint32_t));

      putreg32(w_wd, data_buf_reg);

      /* Update data_buf_reg to point to the next data buffer register. */

      data_buf_reg += sizeof(uint32_t);
    }
}
#endif

/****************************************************************************
 * Name: spislave_setup_rx_dma
 *
 * Description:
 *   Configure the SPI Slave peripheral to perform the next RX data transfer
 *   via DMA.
 *
 * Input Parameters:
 *   priv   - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S2_SPI_DMA
static void spislave_setup_rx_dma(struct spislave_priv_s *priv)
{
  uint32_t length = SPI_SLAVE_BUFSIZE - priv->rx_length;

  esp32s2_dma_setup(priv->dma_rxdesc,
                    SPI_DMA_DESC_NUM,
                    priv->rx_buffer + priv->rx_length,
                    length,
                    false);
  esp32s2_dma_load(priv->dma_rxdesc, priv->dma_channel, false);

  priv->rx_dma_offset = priv->rx_length;

  spislave_dma_rx_fifo_reset(priv);

  spislave_peripheral_reset(priv);

  /* Clear input FIFO full error */

  setbits(SPI_DMA_INFIFO_FULL_ERR_INT_CLR_M,
          SPI_DMA_INT_CLR_REG(priv->config->id));

  /* Enable SPI DMA RX */

  setbits(SPI_DMA_RX_ENA_M, SPI_DMA_CONF_REG(priv->config->id));

  esp32s2_dma_enable(priv->dma_channel, false);
}
#endif

/****************************************************************************
 * Name: spislave_setup_tx_dma
 *
 * Description:
 *   Configure the SPI Slave peripheral to perform the next TX data transfer
 *   via DMA.
 *
 * Input Parameters:
 *   priv   - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S2_SPI_DMA
static void spislave_setup_tx_dma(struct spislave_priv_s *priv)
{
  esp32s2_dma_setup(priv->dma_txdesc,
                    SPI_DMA_DESC_NUM,
                    priv->tx_buffer,
                    SPI_SLAVE_BUFSIZE,
                    true);
  esp32s2_dma_load(priv->dma_txdesc, priv->dma_channel, true);

  spislave_dma_tx_fifo_reset(priv);

  spislave_peripheral_reset(priv);

  /* Clear output FIFO empty error */

  setbits(SPI_DMA_OUTFIFO_EMPTY_ERR_INT_CLR_M,
          SPI_DMA_INT_CLR_REG(priv->config->id));

  /* Enable SPI DMA TX */

  setbits(SPI_DMA_TX_ENA_M, SPI_DMA_CONF_REG(priv->config->id));

  esp32s2_dma_enable(priv->dma_channel, true);
}
#endif

/****************************************************************************
 * Name: spislave_prepare_next_tx
 *
 * Description:
 *   Prepare the SPI Slave controller for transmitting data on the next
 *   transaction.
 *
 * Input Parameters:
 *   priv   - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void spislave_prepare_next_tx(struct spislave_priv_s *priv)
{
  if (priv->tx_length != 0)
    {
#ifdef CONFIG_ESP32S2_SPI_DMA
      spislave_setup_tx_dma(priv);
#else
      spislave_peripheral_reset(priv);

      spislave_write_tx_buffer(priv);

      spislave_cpu_tx_fifo_reset(priv);
#endif

      priv->is_tx_enabled = true;
    }
  else
    {
      spiwarn("TX buffer empty! Disabling TX for next transaction\n");

      spislave_cpu_tx_fifo_reset(priv);

      priv->is_tx_enabled = false;
    }
}

/****************************************************************************
 * Name: spislave_periph_interrupt
 *
 * Description:
 *   Handler for the SPI Slave controller interrupt which is triggered when a
 *   transfer is finished.
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info
 *   arg     - SPI Slave controller private data
 *
 * Returned Value:
 *   Standard interrupt return value.
 *
 ****************************************************************************/

static void spislave_periph_interrupt(void *arg)
{
  struct spislave_priv_s *priv = (struct spislave_priv_s *)arg;
  uint32_t regval = getreg32(SPI_SLAVE1_REG(priv->config->id));
  uint32_t transfer_size = REG_MASK(regval, SPI_SLV_DATA_BYTELEN);

  uint32_t int_clear = SPI_IN_DONE_INT_CLR_M | SPI_OUT_DONE_INT_CLR_M;

  if (!priv->is_processing)
    {
      SPIS_DEV_SELECT(priv->dev, true);
      priv->is_processing = true;
    }

  /* RX process */

  if (transfer_size > 0)
    {
      spislave_store_result(priv, transfer_size);
      SPIS_DEV_NOTIFY(priv->dev, SPISLAVE_RX_COMPLETE);
    }

#ifdef CONFIG_ESP32S2_SPI_DMA
      spislave_prepare_next_rx(priv);
#endif

  /* TX process */

  if (priv->is_tx_enabled && transfer_size > 0)
    {
      spislave_evict_sent_data(priv, transfer_size);
      SPIS_DEV_NOTIFY(priv->dev, SPISLAVE_TX_COMPLETE);
    }

  spislave_prepare_next_tx(priv);

  if (priv->is_processing && esp_gpioread(priv->config->cs_pin))
    {
      priv->is_processing = false;
      SPIS_DEV_SELECT(priv->dev, false);
    }

  /* Clear the trans_done interrupt flag */

  setbits(int_clear, SPI_DMA_INT_CLR_REG(priv->config->id));
}

/****************************************************************************
 * Name: spislave_dma_init
 *
 * Description:
 *   Initialize ESP32-S3 SPI Slave connection to GDMA engine.
 *
 * Input Parameters:
 *   priv   - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S2_SPI_DMA
void spislave_dma_init(struct spislave_priv_s *priv)
{
  /* Enable GDMA clock for the SPI peripheral */

  setbits(priv->config->dma_clk_bit, SYSTEM_PERIP_CLK_EN0_REG);

  /* Reset GDMA for the SPI peripheral */

  resetbits(priv->config->dma_rst_bit, SYSTEM_PERIP_RST_EN0_REG);

  /* Initialize GDMA controller */

  esp32s2_dma_init();

  /* Request a GDMA channel for SPI peripheral */

  priv->dma_channel = esp32s2_dma_request(priv->config->dma_periph, 1, 1,
                                          true);
  if (priv->dma_channel < 0)
    {
      spierr("Failed to allocate GDMA channel\n");

