apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_spi_slave.c
      DEBUGPANIC();
    }

  /* Disable segment transaction mode for SPI Slave */

  resetbits(SPI_DMA_SLV_SEG_TRANS_EN_M, SPI_DMA_CONF_REG(priv->config->id));

  /* Configure DMA In-Link EOF to be generated by trans_done */

  resetbits(SPI_RX_EOF_EN_M, SPI_DMA_CONF_REG(priv->config->id));
}
#endif

/****************************************************************************
 * Name: spislave_initializ_iomux
 *
 * Description:
 *   Initialize ESP32-S3 SPI Slave GPIO by IO MUX.
 *
 * Input Parameters:
 *   priv - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#if SPI_VIA_IOMUX != 0
static void spislave_initializ_iomux(struct spislave_priv_s *priv)
{
  uint32_t attr = INPUT_FUNCTION_5 | DRIVE_0;
  const struct spislave_config_s *config = priv->config;

  esp_configgpio(config->cs_pin, attr | RISING);
  esp_configgpio(config->clk_pin, attr);

  esp_gpio_matrix_out(config->cs_pin,   SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->clk_pin,  SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->mosi_pin, SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->miso_pin, SIG_GPIO_OUT_IDX, 0, 0);

  esp_configgpio(config->mosi_pin, attr);
  esp_configgpio(config->miso_pin, OUTPUT_FUNCTION_5);
}
#endif

/****************************************************************************
 * Name: spislave_initializ_iomatrix
 *
 * Description:
 *   Initialize ESP32-S3 SPI Slave GPIO by IO matrix.
 *
 * Input Parameters:
 *   priv - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#if SPI_VIA_IOMUX == 0 || defined(CONFIG_ESP32S2_SPI3)
static void spislave_initializ_iomatrix(struct spislave_priv_s *priv)
{
  uint32_t attr = INPUT | DRIVE_0;
  const struct spislave_config_s *config = priv->config;

  esp_configgpio(config->cs_pin, attr | RISING);
  esp_gpio_matrix_in(config->cs_pin, config->cs_insig, 0);

  esp_configgpio(config->clk_pin, attr);
  esp_gpio_matrix_in(config->clk_pin, config->clk_insig, 0);

  esp_configgpio(config->mosi_pin, attr);
  esp_gpio_matrix_in(config->mosi_pin, config->mosi_insig, 0);

  esp_configgpio(config->miso_pin, OUTPUT);
  esp_gpio_matrix_out(config->miso_pin, config->miso_outsig, 0, 0);
}
#endif

/****************************************************************************
 * Name: spislave_gpio_initialize
 *
 * Description:
 *   Initialize ESP32-S3 SPI Slave GPIO
 *
 * Input Parameters:
 *   priv - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void spislave_gpio_initialize(struct spislave_priv_s *priv)
{
#if SPI_VIA_IOMUX != 0
  if (priv->config->id == 2)
    {
      spislave_initializ_iomux(priv);
    }
#  ifdef CONFIG_ESP32S2_SPI3
  else
    {
      spislave_initializ_iomatrix(priv);
    }
#  endif
#else
  spislave_initializ_iomatrix(priv);
#endif
}

/****************************************************************************
 * Name: spislave_initialize
 *
 * Description:
 *   Initialize ESP32-S3 SPI Slave hardware interface.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void spislave_initialize(struct spi_slave_ctrlr_s *ctrlr)
{
  uint32_t regval;
  struct spislave_priv_s *priv = (struct spislave_priv_s *)ctrlr;
  const struct spislave_config_s *config = priv->config;

  spiinfo("ctrlr=%p\n", ctrlr);

  spislave_gpio_initialize(priv);

  setbits(config->clk_bit, SYSTEM_PERIP_CLK_EN0_REG);
  resetbits(config->rst_bit, SYSTEM_PERIP_RST_EN0_REG);

  /* Configure SPI Slave peripheral */

  putreg32(0, SPI_CLOCK_REG(priv->config->id));

  regval = SPI_DOUTDIN_M;
  putreg32(regval, SPI_USER_REG(priv->config->id));

  putreg32(0, SPI_CTRL_REG(priv->config->id));

  regval = SPI_SLAVE_MODE_M;
#ifdef CONFIG_ESP32S2_SPI_DMA
  regval |= SPI_SLV_WRDMA_BYTELEN_EN_M | SPI_SLV_RDDMA_BYTELEN_EN_M;
#else
  regval |= SPI_SLV_WRBUF_BYTELEN_EN_M | SPI_SLV_RDBUF_BYTELEN_EN_M;
#endif

  putreg32(regval, SPI_SLAVE_REG(priv->config->id));

  spislave_peripheral_reset(priv);

  /* Use all 64 bytes of the SPI hardware data buffer */

  resetbits(SPI_USR_MISO_HIGHPART_M | SPI_USR_MOSI_HIGHPART_M,
            SPI_USER_REG(priv->config->id));

  /* Disable interrupts */

  resetbits(SPI_INT_MASK, SPI_DMA_INT_ENA_REG(priv->config->id));

#ifdef CONFIG_ESP32S2_SPI_DMA
  spislave_dma_init(priv);
#endif

  esp_gpioirqenable(config->cs_pin);

  /* Force a transaction done interrupt.
   * This interrupt won't fire yet because we initialized the SPI interrupt
   * as disabled. This way, we can just enable the SPI interrupt and the
   * interrupt handler will kick in, handling any transactions that are
   * queued.
   */

  regval = SPI_IN_DONE_INT_CLR_M | SPI_OUT_DONE_INT_CLR_M;
  setbits(regval, SPI_DMA_INT_RAW_REG(priv->config->id));
  setbits(regval, SPI_DMA_INT_ENA_REG(priv->config->id));
}

/****************************************************************************
 * Name: spislave_deinitialize
 *
 * Description:
 *   Deinitialize ESP32-S3 SPI Slave hardware interface.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void spislave_deinitialize(struct spi_slave_ctrlr_s *ctrlr)
{
  struct spislave_priv_s *priv = (struct spislave_priv_s *)ctrlr;

  esp_gpioirqdisable(priv->config->cs_pin);

  /* Disable the trans_done interrupt */

  resetbits(SPI_IN_DONE_INT_CLR_M, SPI_DMA_INT_ENA_REG(priv->config->id));
  resetbits(SPI_OUT_DONE_INT_CLR_M, SPI_DMA_INT_ENA_REG(priv->config->id));

#ifdef CONFIG_ESP32S2_SPI_DMA
  resetbits(priv->config->dma_clk_bit, SYSTEM_PERIP_CLK_EN0_REG);
  priv->rx_dma_offset = 0;
#endif

  setbits(priv->config->clk_bit, SYSTEM_PERIP_RST_EN0_REG);
  resetbits(priv->config->clk_bit, SYSTEM_PERIP_CLK_EN0_REG);

